{
  "id": "driver-exchange",
  "title": "Driver Exchange",
  "subtitle": "Streamlining Minor Accident Reporting",
  "year": "2020",
  "role": "Design Lead",
  "coverImage": "/images/driver-exchange/cover.jpg",
  "sections": [
    {
      "type": "intro",
      "content": "In 2020, I partnered with the Carfax for Police product team as design lead on MyCrash's initial rollout. Through user research and stakeholder workshops with police departments, we shaped the core user flows for emergency scene reporting. Early testing revealed critical trust barriers that influenced our security-first design approach."
    },
    {
      "type": "stakeholders",
      "title": "Stakeholders",
      "items": [
        {
          "role": "Officers",
          "need": "Overwhelmed by paperwork, prefer active patrol"
        },
        {
          "role": "Drivers",
          "need": "Stressed, need clear guidance"
        }
      ]
    },
    {
      "type": "challenge",
      "title": "The Challenge",
      "content": "Police departments waste countless hours responding to minor accidents. At Seattle PD alone, officers spent 73 minutes average per fender-bender - time better spent on critical emergencies. Both departments and officers were desperate for a solution that would let citizens self-report these incidents.",
      "stats": [
        {
          "value": "73",
          "unit": "minutes",
          "description": "Average time spent per minor accident"
        }
      ]
    },
    {
      "type": "research",
      "title": "What we Learned in User Testing",
      "content": "Early testing revealed two critical barriers: trust and form fatigue. Users immediately questioned app legitimacy. \"How do I know this is real?\" came up in a number of sessions. The Carfax branding alone wasn't enough - users needed explicit security messaging. This shaped our initial screen design - clear police endorsement and security messaging all visible from the start."
    },
    {
      "type": "research",
      "title": "Minimizing Post-Accident Stress",
      "content": "Research shows users abandon lengthy forms due to cognitive load and fatigue. While accident reporting carries inherent motivation due to its official nature (high task criticality), the emotional stress of a crash makes complex forms especially draining. We hacked this psychological barrier by starting progress at 30% - making the task feel partially complete before it really begins."
    },
    {
      "type": "research",
      "title": "QR's Pandemic Revival",
      "content": "Early designs avoided QR codes, assuming they'd overwhelm stressed users. COVID flipped this assumption - suddenly everyone was using QR codes daily for menus and check-ins. QR adoption was undergoing a surge during the design process. We leaned into this cultural shift, making QR-based sharing central to our design."
    }
  ]
}
